#pragma once
//куб

namespace Figure{

float vertices_cube[] =
    {
//      x      y      z     r     g     b
        -0.5f, -0.5f, 0.5f, 1.0f, 0.0f, 0.0f,
         0.5f, -0.5f, 0.5f, 0.0f, 1.0f, 0.0f,
         0.5f,  0.5f, 0.5f, 0.0f, 0.0f, 1.0f,
        -0.5f,  0.5f, 0.5f, 1.0f, 1.0f, 0.0f,

        -0.5f, -0.5f, -0.5f, 1.0f, 0.0f, 1.0f,
         0.5f, -0.5f, -0.5f, 0.0f, 1.0f, 1.0f,
         0.5f,  0.5f, -0.5f, 0.0f, 0.0f, 1.0f,
        -0.5f,  0.5f, -0.5f, 1.0f, 1.0f, 0.0f,
    };

unsigned int indices_cube[] =
    {
        //передняя грань
        0, 1, 2, 2, 3, 0,

        //задняя грань
        4, 6, 5, 4, 7, 6,

        //левая грань
        0, 3, 7, 0, 7, 4,

        //правая грань
        1, 5, 6, 1, 6, 2,

        //верхняя грань
        2, 6, 7, 2, 7, 3,

        //нижняя грань
        0, 4, 5, 0, 5, 1

    };
}