#pragma once

namespace Figure{

//куб
    float vertices_cube[] =
    {
//      x      y      z     r     g     b
        -1.0f, -1.0f, 1.0f, 1.0f, 0.0f, 0.0f,
         1.0f, -1.0f, 1.0f, 0.0f, 1.0f, 0.0f,
         1.0f,  1.0f, 1.0f, 0.0f, 0.0f, 1.0f,
        -1.0f,  1.0f, 1.0f, 1.0f, 1.0f, 0.0f,

        -1.0f, -1.0f, -1.0f, 1.0f, 0.0f, 1.0f,
         1.0f, -1.0f, -1.0f, 0.0f, 1.0f, 1.0f,
         1.0f,  1.0f, -1.0f, 0.0f, 0.0f, 1.0f,
        -1.0f,  1.0f, -1.0f, 1.0f, 1.0f, 0.0f,
    };

    unsigned int indices_cube[] =
    {
        //передняя грань
        0, 1, 2, 2, 3, 0,

        //задняя грань
        4, 6, 5, 4, 7, 6,

        //левая грань
        0, 3, 7, 0, 7, 4,

        //правая грань
        1, 5, 6, 1, 6, 2,

        //верхняя грань
        2, 6, 7, 2, 7, 3,

        //нижняя грань
        0, 4, 5, 0, 5, 1

    };


//Параллелипипед
    float vertices_paral[] =
    {
//      x      y      z     r     g     b
        -1.0f, -0.1f, 1.0f, 1.0f, 0.0f, 0.0f,
         1.0f, -0.1f, 1.0f, 0.0f, 1.0f, 0.0f,
         1.0f,  0.1f, 1.0f, 0.0f, 0.0f, 1.0f,
        -1.0f,  0.1f, 1.0f, 1.0f, 1.0f, 0.0f,

        -1.0f, -0.1f, -1.0f, 1.0f, 0.0f, 1.0f,
         1.0f, -0.1f, -1.0f, 0.0f, 1.0f, 1.0f,
         1.0f,  0.1f, -1.0f, 0.0f, 0.0f, 1.0f,
        -1.0f,  0.1f, -1.0f, 1.0f, 1.0f, 0.0f,
    };

    unsigned int indices_paral[] =
    {
        //передняя грань
        0, 1, 2, 2, 3, 0,

        //задняя грань
        4, 6, 5, 4, 7, 6,

        //левая грань
        0, 3, 7, 0, 7, 4,

        //правая грань
        1, 5, 6, 1, 6, 2,

        //верхняя грань
        2, 6, 7, 2, 7, 3,

        //нижняя грань
        0, 4, 5, 0, 5, 1

    };

//Пирамида
    float vertices_triangle[] =
    {
//      x      y      z     r     g     b
//        1.0f,  -1.0f,  1.0f, 1.0f, 0.0f, 0.0f,
//        1.0f,  -1.0f, -1.0f, 0.0f, 1.0f, 0.0f,
//        -1.0f, -1.0f, -1.0f, 0.0f, 1.0f, 0.0f,
//        -1.0f, -1.0f,  1.0f, 0.0f, 1.0f, 0.0f,
//        0.0f,   1.0f,  0.0f, 0.0f, 0.0f, 1.0f,

        -1.0f, 0.0f, -1.0f,       1.0f, 0.0f, 0.0f, // 0
         1.0f, 0.0f, -1.0f,       0.0f, 1.0f, 0.0f, // 1
         1.0f, 0.0f,  1.0f,       0.0f, 0.0f, 1.0f, // 2
        -1.0f, 0.0f,  1.0f,       1.0f, 1.0f, 0.0f, // 3

        // вершина пирамиды
        0.0f, 1.0f,  0.0f,       1.0f, 0.0f, 1.0f  // 4
    };

    unsigned int indices_triangle[] =
    {

        //передняя грань
        0, 1, 4,

        // правая грань
        1, 2, 4,

        // задняя грань
        2, 3, 4,

        // левая грань
        3, 0, 4,

        // основание
        0, 3, 2,
        0, 2, 1

    };
}